<document>
<text>SQL &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; CREATE &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1042; SQLite &#1087;&#1088;&#1080; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; CREATE (&#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072; CREATE) &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100;: &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1088;&#1080;&#1075;&#1075;&#1077;&#1088;&#1099;, &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1099;, &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;:
CREATE TABLE;
CREATE INDEX;
CREATE TRIGGER;
CREATE VIEW;
CREATE VIRTUAL TABLE.
&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; CREATE (&#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; CREATE) &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1085;&#1072;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1074; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; SQLite3. &#1054;&#1073;&#1097;&#1080;&#1081; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094; &#1074; SQLite3 &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; &#1085;&#1080;&#1078;&#1077;.
</text>
<picture>CREATE.png</picture>
<text>&#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;:</text>
<title>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1073;&#1077;&#1079; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1086;&#1074;</title>
<code>CREATE TABLE table1 (a,b,c,d);</code>
<text>&#1044;&#1072;&#1085;&#1085;&#1072;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1089;&#1090; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; table1 &#1089;&#1086; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;&#1084;&#1080; a, b, c, d &#1080; &#1087;&#1088;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1057;&#1059;&#1041;&#1044; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090; &#1090;&#1080;&#1087; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1077;.</text>
<title>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1089; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;&#1084; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1086;&#1074; &#1080; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;</title>
<code>CREATE TABLE table2 (
id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
name TEXT NOT NULL,
surname TEXT NOT NULL,
age INT NOT NULL,
address TEXT NOT NULL
);</code>
<text>&#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1088;&#1080; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; CREATE (&#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072; CREATE) &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091;, &#1103;&#1074;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1074; &#1090;&#1080;&#1087; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;, &#1090;&#1072;&#1082; &#1078;&#1077; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1089;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1087;&#1091;&#1089;&#1090;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1072; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1089;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094; id &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1091;&#1088;&#1088;&#1086;&#1075;&#1072;&#1090;&#1085;&#1099;&#1084; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; (&#1086;&#1073; &#1101;&#1090;&#1086;&#1084; &#1089;&#1074;&#1080;&#1076;&#1077;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; PRIMARY KEY &#1080; AUTOINCREMENT).</text>
<title>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1082;&#1074;&#1072;&#1083;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072;</title>
<code>CREATE TABLE main.table3 (
a INTEGER NOT NULL,
b TEXT UNIQUE NOT NULL,
c REAL NOT NULL,
PRIMARY KEY(a)
);</code>
<title>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1089; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1086;&#1081; &#1085;&#1072; &#1077;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</title>
<text>&#1050;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1077; &#1085;&#1086;&#1074;&#1099;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;, &#1090;&#1086; &#1085;&#1077; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1072;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1085;&#1077; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077; &#1080;&#1084;&#1077;&#1085;&#1072; &#1091;&#1078;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; SQLite &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1090;&#1100; &#1080;&#1084;&#1077;&#1085;&#1072; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094; &#1085;&#1072; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076; &#1080;&#1093; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;&#1084;, &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103; IF NOT EXISTS:</text>
<code>CREATE TABLE IF NOT EXISTS table4 (
a INTEGER NOT NULL,
b TEXT  UNIQUE NOT NULL,
c REAL NOT NULL,
PRIMARY KEY(a)
);</code>
<text>&#1045;&#1089;&#1083;&#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; table5 &#1074; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090;, &#1090;&#1086; SQLite &#1089;&#1086;&#1079;&#1076;&#1072;&#1089;&#1090; &#1101;&#1090;&#1091; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; table5 &#1073;&#1091;&#1076;&#1077;&#1090; &#1074; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1090;&#1086; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090;.</text>
<title>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;</title>
<text>&#1055;&#1086;&#1084;&#1080;&#1084;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1093; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;, SQLite &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1074; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;. &#1042;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1074; SQLite &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1101;&#1090;&#1091; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;, &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1077; &#1091;&#1074;&#1080;&#1076;&#1103;&#1090; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091;.</text>
<code>CREATE TEMP TABLE table5 (
a INTEGER NOT NULL,
b TEXT  UNIQUE NOT NULL,
c REAL NOT NULL,
PRIMARY KEY(a)
);</code>
<text>&#1042;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1074; SQLite &#1080;&#1084;&#1077;&#1102;&#1090; &#1087;&#1086;&#1084;&#1077;&#1090;&#1082;&#1091; temp. &#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1086;&#1075;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072; TEMP &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1086;&#1077; &#1089;&#1083;&#1086;&#1074;&#1086; TEMPORARY.</text>
<title>&#1057;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;:</title>
<text>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; tab1, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1091;&#1102; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1086;&#1083;&#1103;:
id - integer;
name - text;
pro - text;
sex - text;
sal - real.</text>
<code type="answer">create table tab1 (id integer, name text, pro text, sex text, sal real)</code>
<answer>CREATE TABLE tab1(id integer, name text, pro text, sex text, sal real)</answer>
</document>