<document>
<text>&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; DROP &#1074; SQLite3 &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1085;&#1072;&#1084; &#1091;&#1076;&#1072;&#1083;&#1103;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1055;&#1088;&#1080; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; DROP  &#1074; SQLite3 &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100;:
&#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; (TABLE); 
&#1080;&#1085;&#1076;&#1077;&#1082;&#1089; (INDEX);
&#1090;&#1088;&#1080;&#1075;&#1075;&#1077;&#1088; (TRIGGER);
&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; (VIEW);
&#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (DATABASE).
&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; DROP TABLE &#1074; SQLite3 &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1091;&#1076;&#1072;&#1083;&#1103;&#1090;&#1100; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1080;&#1079; &#1085;&#1072;&#1096;&#1077;&#1081; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1057;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072; DROP TABLE &#1074; SQLite3 &#1087;&#1088;&#1086;&#1089;&#1090; &#1076;&#1086; &#1073;&#1077;&#1079;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1103;.</text>
<picture>DROP.png</picture>
<text>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:</text>
<title>&#1055;&#1088;&#1086;&#1089;&#1090;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;</title>
<code>DROP TABLE table1;</code>
<title>&#1059;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1089; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1086;&#1081; &#1085;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;</title>
<code>DROP TABLE IF EXISTS table1;</code>
<title>&#1059;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077;&#1084; &#1082;&#1074;&#1072;&#1083;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072;</title>
<text>&#1044;&#1091;&#1084;&#1072;&#1102;, &#1074;&#1099; &#1091;&#1078;&#1077; &#1076;&#1086;&#1075;&#1072;&#1076;&#1072;&#1083;&#1080;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103; IF EXIST &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1087;&#1077;&#1088;&#1074;&#1072; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; SQLite3, &#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1083;&#1080; &#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077;, &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; DROP TABLE. &#1052;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1084; &#1103;&#1074;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1093;&#1086;&#1090;&#1080;&#1084; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091;, &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1090;&#1072;&#1074;&#1080;&#1084; &#1090;&#1086;&#1095;&#1082;&#1091; &#1087;&#1077;&#1088;&#1077;&#1076; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1080; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084; &#1080;&#1084;&#1103; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.</text>
<code>DROP TABLE main.table5;</code>
<title>&#1057;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;:</title>
<text>&#1059;&#1076;&#1072;&#1083;&#1080;&#1090;&#1077; &#1090;&#1072;&#1083;&#1080;&#1094;&#1091; tab1, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1091;&#1102; &#1074;&#1072;&#1084;&#1080; &#1074; &#1087;&#1088;&#1086;&#1096;&#1083;&#1086;&#1084; &#1091;&#1088;&#1086;&#1082;&#1077;.</text>
<code type="answer">drop table tab1</code>
<answer>DROP TABLE tab1;</answer>
</document>