<document>
<text>&#1054;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; ALTER &#1074; SQLite3 &#1091;&#1084;&#1077;&#1077;&#1090; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1088;&#1086;&#1074;&#1085;&#1086; &#1076;&#1074;&#1077; &#1074;&#1077;&#1097;&#1080;: &#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1077; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1080;. &#1057;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; ALTER &#1074; SQLite3 &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085; &#1085;&#1080;&#1078;&#1077;.</text>
<picture>ALTER.png</picture>
<text>&#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091;</text>
<code>CREATE TABLE table1 (a,b,c,d);</code>
<title>&#1055;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091;</title>
<code>ALTER TABLE table1 RENAME TO table5;</code>
<text>&#1059;&#1073;&#1077;&#1076;&#1080;&#1084;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1086; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;, &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103;&#1089;&#1100; &#1074;&#1089;&#1105; &#1090;&#1086;&#1081; &#1078;&#1077; .tables.</text>
<title>&#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1089;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094;</title>
<code>ALTER TABLE table2 ADD COLUMN e;</code>
<text>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;: &#1085;&#1086;&#1074;&#1086;&#1084;&#1091; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1091; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080;, &#1082;&#1072;&#1082; &#1080; &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1085;&#1086;&#1074;&#1086;&#1081; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085; &#1085;&#1086;&#1074;&#1099;&#1081; &#1089;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094;, &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077;&#1089;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; .schema table2.</text>
<code>ALTER TABLE table3 ADD COLUMN e TEXT NOT NULL;</code>
<title>&#1057;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;:</title>
<text>&#1044;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; tab1 &#1089;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094; age (integer). &#1058;&#1072;&#1082;&#1078;&#1077; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1081;&#1090;&#1080; &#1090;&#1077;&#1089;&#1090; &#1087;&#1086; QR &#1082;&#1086;&#1076;&#1091; &#1085;&#1080;&#1078;&#1077;:</text>
<code type="answer">alter table tab1 add column age integer</code>
<answer>ALTER TABLE tab1 ADD COLUMN age INTEGER;</answer>
<URL>https://videouroki.net/tests/917436745/</URL>
</document>